Repository: Wuxriff/TelegramBotSrc
Catalog: Sources/src/ReminderBot.Shared/Resources/SharedResource.*.resx
Languages: be, ru, uk

# Admin_NotAdminMessage
source: Sorry, but you do not have administrator access rights
be: Прабачце, але ў вас няма правоў доступу адміністратара
ru: Простите, но у вас нет прав доступа администратора
uk: Вибачте, але у вас немає прав доступу адміністратора

# Cancel_OperationCanceledMessage
source: The operation is canceled by user
be: Аперацыя адменена карыстальнікам
ru: Операция отменена пользователем
uk: Операцію скасовано користувачем

# Create_HeaderParsedDateFormatMessage
source: Is this the date and time you wanted: {0}?
be: Гэта тая дата і час, што вы хацелі: {0}?
ru: Это та дата и время что вы хотели: {0}?
uk: Це та дата та час, що ви хотіли: {0}?

# Create_HeaderParsedIncorrectMessage
source: Okay, try setting the date in a different format, more advanced and consistent with the correct formats from the help. Please, create the correct reminder again
be: Добра, паспрабуйце задаць дату ў іншым фармаце, больш пашыраным і які адпавядае карэктным фарматам з даведкі. Паспрабуйце стварыць карэктны напамін зноў
ru: Хорошо, попробуйте задать дату в другом формате, более расширенном и соответствующем корректным форматам из справки. Попробуйте создать корректное напоминание снова
uk: Добре, спробуйте задати дату в іншому форматі, більш розширеному та відповідному коректним форматам з довідки. Спробуйте створити коректне нагадування знову

# Create_InvalidDateFormatError
source: Invalid date and time value. Use the {0} command to learn how to create reminders
be: Недапушчальнае значэнне даты і часу. Выкарыстоўвайце каманду {0}, каб даведацца як ствараць напамінкі
ru: Недопустимое значение даты и времени. Используйте команду {0}, чтобы узнать как создавать напоминания
uk: Неприпустиме значення дати та часу. Використовуйте команду {0}, щоб дізнатися як створювати нагадування

# Create_InvalidTextError
source: You cannot create a reminder without text. Please, create the correct reminder again
be: Нельга стварыць напамінак без тэксту. Калі ласка, стварыце карэктны напамін нанова
ru: Нельзя создать напоминание без текста. Пожалуйста, создайте корректное напоминание заново
uk: Не можна створити нагадування без тексту. Будь ласка, створіть коректне нагадування заново

# Create_NoButton
source: No
be: Не
ru: Нет
uk: Ні

# Create_NoLocationFormatError
source: You cannot create reminders unless your location is set in the settings. Use the {0} command to go to the settings module and set it
be: Вы не можаце ствараць напамінкі пакуль у наладах не зададзены ваша месцазнаходжанне. Выкарыстоўвайце каманду {0} каб перайсці ў модуль налад і задаць яго
ru: Вы не можете создавать напоминания пока в настройках не задан ваше местонахождение. Используйте команду {0} чтобы перейти в модуль настроек и задать его
uk: Ви не можете створювати нагадування поки в налаштуваннях не встановлено місцезнаходження. Використовуйте команду {0}, щоб перейти в модуль налаштувань і встановити його

# Create_SuccessFormatMessage
source: Reminder created. Will be executed around: {0}
be: Напамінак створана. Будзе выклікана прыкладна: {0}
ru: Напоминание создано. Будет вызвано примерно: {0}
uk: Нагадування створено. Буде викликано приблизно: {0}

# Create_YesButton
source: Yes
be: Так
ru: Да
uk: Так

# Edit_DeleteReminderButton
source: Delete
be: Выдаліць
ru: Удалить
uk: Видалити

# Edit_InvalidUserMessage
source: Error, you are trying to access someone else's reminder
be: Памылка, вы спрабуеце атрымаць доступ да чужых напамінкаў
ru: Ошибка, вы пытаетесь получить доступ к чужим напоминаниям
uk: Помилка, ви намагаєтеся отримати доступ до чужих нагадувань

# Edit_ReminderDeletedMessage
source: Reminder deleted
be: Напамін выдалена
ru: Напоминание удалено
uk: Нагадування видалено

# Edit_ShowReminderContentFormatMessage
source: Remind at: {0} Content: {1}
be: Нагадаць у: {0} Змесціва: {1}
ru: Напомнить в: {0} Содержимое: {1}
uk: Нагадати в: {0} Вміст: {1}

# Exception_Message
source: An unknown critical error occurred and all operations were canceled
be: Адбылася невядомая крытычная памылка, усе аперацыі былі адменены
ru: Произошла неизвестная критическая ошибка, все операции были отменены
uk: Відбулася невідома критична помилка, всі операції було скасовано

# Help_ContentFormatMessage
source: CONTENT
be: КАНТЭНТ
ru: КОНТЕНТ
uk: КОНТЕНТ

# Help_HeaderMessage
source: This module will help you understand how to use the bot
be: Гэты модуль дапаможа вам зразумець як карыстацца ботам.
ru: Этот модуль поможет вам понять как пользоваться ботом
uk: Цей модуль допоможе вам зрозуміти як користуватись ботом

# Help_SupportedLanguagesFormatMessage
source: Supported languages: {0}, {1}, {2}, {3}
be: Падтрымоўваныя мовы: {0}, {1}, {2}, {3}
ru: Поддерживаемые языки: {0}, {1}, {2}, {3}
uk: Підтримувані мови: {0}, {1}, {2}, {3}

# Manage_ExportAllButton
source: Export as .txt
be: Экспарт у .txt
ru: Экспорт в .txt
uk: Експорт у .txt

# Manage_ExportEmptyMessage
source: Reminders are missing
be: Адсутнічаюць напамінкі
ru: Отсутствуют напоминания
uk: Відсутні нагадування

# Manage_MainHeaderMessage
source: Reminders management. Here you can view your active reminders or export the entire archive as .txt file
be: Кіраванне напамінкамі. Тут вы можаце прагледзець вашыя актыўныя напамінкі або экспартаваць увесь архіў як .txt файл
ru: Управление напоминаниями. Здесь вы можете просмотреть ваши активные напоминания или экспортировать весь архив как .txt файл
uk: Управління нагадуваннями. Тут ви можете переглянути ваші активні нагадування або експортувати весь архів як файл .txt

# Manage_ViewActiveButton
source: View active
be: Прагледзець актыўныя
ru: Просмотреть активные
uk: Переглянути активні

# Manage_WelcomeMessage
source: Your active reminders
be: Вашы актыўныя напамінкі
ru: Ваши активные напоминания
uk: Ваші активні нагадування

# Pause_RemindersPausedMessage
source: Reminders paused
be: Напамінкі прыпынены
ru: Напоминания приостановлены
uk: Нагадування припинено

# Reminder_ConfirmButton
source: Confirm
be: Пацвердзіць
ru: Подтвердить
uk: Підтвердити

# Reminder_InvalidUserMessage
source: Error, you are trying to access someone else's reminder
be: Памылка, вы спрабуеце атрымаць доступ да чужых напамінкаў
ru: Ошибка, вы пытаетесь получить доступ к чужим напоминаниям
uk: Помилка, ви намагаєтеся отримати доступ до чужих нагадувань

# Reminder_PostponeFormatButton
source: Postpone {0}m
be: Адкласці {0}мін
ru: Отложить {0}мин
uk: Відкласти {0}хв

# Resume_RemindersResumedMessage
source: Reminders resumed
be: Напаміны ўзноўлены
ru: Напоминания возоблены
uk: Нагадування поновлено

# Settings_AutoDeleteFormatButton
source: {0} autodelete
be: {0} аўтавыдаленне
ru: {0} автоудаление
uk: {0} автовидалення

# Settings_AutoDeleteHeaderMessage
source: Do you want to change autodelete for confirmed reminders?
be: Вы хочаце задаць параметры аўтавыдалення для пацверджаных напамінкаў?
ru: Вы хотите задать параметры автоудаления для подтвержденных напоминаний?
uk: Ви хочете встановити параметри автовидалення для підтверджених нагадувань?

# Settings_AutoDeleteMenuFormatButton
source: Change autodelete: {0}
be: Задаць аўтавыдаленне: {0}
ru: Задать автоудаление: {0}
uk: Задати автовидалення: {0}

# Settings_AutoDeleteMenu_Disabled
source: disabled
be: выключана
ru: выключено
uk: вимкнено

# Settings_AutoDeleteMenu_Enabled
source: enabled
be: уключана
ru: включено
uk: увімкнено

# Settings_AutoDeleteSuccessFormatMessage
source: Autodelete for confirmed reminders is: {0}
be: Аўтавыдаленне для пацверджаных напамінкаў: {0}
ru: Автоудаление для подтвержденных напоминаний: {0}
uk: Автовидалення для підтверджених нагадувань: {0}

# Settings_AutoDelete_Disable
source: Disable
be: Выключыць
ru: Выключить
uk: Вимкнути

# Settings_AutoDelete_Enable
source: Enable
be: Уключыць
ru: Включить
uk: Увімкнути

# Settings_DateFormatCurrentFormatButton
source: Keep current ({0})
be: Пакінуць цяперашні ({0})
ru: Оставить текущий ({0})
uk: Залишити поточний ({0})

# Settings_DateFormatMenuButton
source: Change date and time display format
be: Задаць фармат паказу даты і часу
ru: Задать формат показа даты и времени
uk: Задати формат показу дати та часу

# Settings_DateFormatSuccessFormatMessage
source: Date and time format is set to: {0}
be: Фармат даты і часу ўсталяваны ў: {0}
ru: Формат даты и времени установлен в: {0}
uk: Формат дати та часу встановлений у: {0}

# Settings_DateFormatWelcomeMessage
source: Select new display date and time format
be: Абярыце новы фармат даты і часу для адлюстравання
ru: Выберите новый формат даты и времени для отображения
uk: Виберіть новий формат дати та часу для відображення

# Settings_LanguageHeaderMessage
source: Please, select your bot language. Note that the language of the bot command list cannot be changed and it will remain in the same language that is specified in the settings of your Telegram account
be: Калі ласка, абярыце сваю мову для бота. Вучыце што мову спісу каманд бота немагчыма змяніць і ён застанецца на той жа мове, які зададзены ў наладах вашага Telegram-акаўнта
ru: Пожалуйста, выберите свой язык для бота. Учите что язык списка команд бота невозможно изменить и он останется на том же языке, который задан в настройках вашего Telegram-аккаунта
uk: Будь ласка, оберіть свою мову для бота. Вивчайте, що мову списку команд бота неможливо змінити і вона залишиться тією ж мовою, яка задана в налаштуваннях вашого Telegram-акаунта

# Settings_LanguageSuccessMessage
source: Bot language has been changed
be: Мова бота была зменена
ru: Язык бота был изменен
uk: Мова бота була змінена

# Settings_LocationHeaderMessage
source: The bot needs to know your time zone, otherwise it won't be able to work. You can click the button below to send your exact geolocation or click the 'paperclip' icon and share a less precise location with the bot if you are worried about revealing your personal data
be: Боту неабходна ведаць ваш гадзінны пояс, інакш ён не зможа функцыянаваць. Вы можаце націснуць на кнопку знізу каб падзяліцца сваім дакладным месцазнаходжаннем або націснуць на ікноку 'сашчэпкі' і падзяліцца менш дакладным месцазнаходжаннем з ботам калі вы асцерагаецеся раскрыцця вашых асабістых дадзеных
ru: Боту необходимо знать ваш часовой пояс, иначе он не сможет функционировать. Вы можете нажать на кнопку снизу чтобы поделиться своим точным местоположением или нажать на икноку 'скрепки' и поделиться менее точным местоположением с ботом если вы опасаетесь раскрытия ваших личных данных
uk: Боту необхідно знати часовий пояс, інакше він не зможе функціонувати. Ви можете натиснути кнопку знизу, щоб поділитися своїм точним місцезнаходженням або натиснути на іконку 'скріпки' і поділитися менш точним місцезнаходженням з ботом якщо ви побоюєтеся розкриття ваших особистих даних

# Settings_LocationInvalidLocationDataMessage
source: Incorrect coordinates. It's possible that you didn't send coordinates at all. Please send the coordinates using the correct method specified above
be: Некарэктныя каардынаты. Магчыма вы адправілі зусім не каардынаты. Калі ласка, адпраўце каардынаты карэктным спосабам, указаным вышэй
ru: Некорректные координаты. Возможно вы отправили вовсе не координаты. Пожалуйста, отправьте координаты корректным способом, указанным выше
uk: Некоректні координати. Можливо, ви відправили зовсім не координати. Будь ласка, надішліть координати коректним способом, вказаним вище

# Settings_LocationInvalidLocationMessage
source: Incorrect coordinates. Please, send the coordinates using the correct method specified above
be: Некарэктныя каардынаты. Калі ласка, адпраўце каардынаты карэктным спосабам, указаным вышэй
ru: Некорректные координаты. Пожалуйста, отправьте координаты корректным способом, указанным выше
uk: Некоректні координати. Будь ласка, надішліть координати коректним способом, вказаним вище

# Settings_LocationShareButton
source: 📍 Click here to share your exact location
be: 📍 Націсніце каб падзяліцца дакладным месцазнаходжаннем
ru: 📍 Нажмите чтобы поделиться точным местоположением
uk: 📍 Натисніть, щоб поділитися точним розташуванням

# Settings_LocationSuccessMessage
source: Success! Now you can create reminders and use all the bot features Detected location parameters: Country: {0} Location: {1} Timezone: {2} Default display date and time format (can be changed in settings): {3}
be: Паспяхова! Цяпер вы можаце ствараць напамінкі і выкарыстоўваць усе астатнія функцыі бота Выяўленыя параметры лакацыі: Краіна: {0} Месцазнаходжанне: {1} Часавы пояс: {2} Фармат адлюстравання даты і часу па змаўчанні (могуць быць зменены): {3}
ru: Успешно! Теперь вы можете создавать напоминания и использовать все остальные функции бота Обнаруженные параметры локации: Страна: {0} Местоположение: {1} Часовой пояс: {2} Формат отображения даты и времени по-умолчанию (могут быть изменены): {3}
uk: Успішно! Тепер ви можете створювати нагадування та використовувати всі інші функції бота Виявлені параметри локації: Країна: {0} Розташування: {1} Часовий пояс: {2} Формат відображення дати та часу за умовчанням (можуть бути змінені): {3}

# Settings_MainHeaderMessage
source: Settings module. Here you can configure various bot parameters
be: Модуль настроек. Тут вы можаце наладзіць розныя параметры бота.
ru: Модуль настроек. Тут вы можете настроить различные параметры бота
uk: Модуль налаштувань. Тут ви можете налаштувати різні параметри робота

# Settings_PostponeFormatMessage
source: When a reminder is displayed, there is an option to postpone it so that the bot will remind you about it later. Set this value in minutes, allowed range ({0} - {1}), integer values only
be: Пры адлюстраванні напамінкі ёсць магчымасць адкласці яго каб бот нагадаў пра яго пазней. Задайце гэтае значэнне ў хвілінах, дазволены дыяпазон ({0} - {1}), толькі цэлалікавыя значэння
ru: При отображении напоминания есть возможность отложить его чтобы бот напомнил о нем позже. Задайте это значение в минутах, разрешенный диапазон ({0} - {1}), только целочисленные значения
uk: При відображенні нагадування можна відкласти його щоб бот нагадав про нього пізніше. Задайте це значення в хвилинах, дозволений діапазон ({0} - {1}), тільки цілочислові значення

# Settings_PostponeInvalidFormatMessage
source: Invalid postpone value. Please, send a new value for postpone, allowed range ({0} - {1}), integer values only
be: Недапушчальнае значэнне для адкладвання. Калі ласка, адпраўце новае значэнне для адкладвання, дазволены дыяпазон ({0} - {1}), толькі цэлалікавыя значэння
ru: Недопустимое значение для откладывания. Пожалуйста, отправьте новое значение для откладывания, разрешенный диапазон ({0} - {1}), только целочисленные значения
uk: Неприпустиме значення для відкладання. Будь ласка, відправте нове значення для відкладення, дозволений діапазон ({0} - {1}), лише цілі значення

# Settings_PostponeMenuFormatButton
source: Change postpone delay: {0}m
be: Задаць інтэрвал адкладвання: {0}мін
ru: Задать интервал откладывания: {0}мин
uk: Задати інтервал відкладання: {0}хв

# Settings_PostponeSuccessFormatMessage
source: Reminders postpone is set to: {0}m
be: Адкладванне напамінкаў устаноўлена на: {0}мін
ru: Откладывание напоминаний установлено на: {0}мин
uk: Відкладення нагадувань встановлено на: {0}хв

# Settings_SetLanguageMenuButton
source: Change bot language
be: Задаць мову бота
ru: Задать язык бота
uk: Задати мову бота

# Settings_SetLocationMenuFormatButton
source: Change location: {0}
be: Задаць месцазнаходжанне: {0}
ru: Задать местоположение: {0}
uk: Поставити розташування: {0}

# Start_WelcomeFormatMessage
source: 👋 Hello {0}, welcome to Reminder Bot!
be: 👋 Прывітанне {0}, сардэчна запрашаем у Reminder Bot!
ru: 👋 Привет {0}, добро пожаловать в Reminder Bot!
uk: 👋 Привіт, {0}! Вітаємо в Reminder Bot!

# Stop_StopButton
source: Stop
be: Спыніць
ru: Остановить
uk: Зупинити

# Stop_StopEraseButton
source: Stop and delete
be: Спыніць і выдаліць
ru: Остановить и удалить
uk: Зупинити та видалити

# Stop_StopMessage
source: Do you want to stop the bot or stop and delete your data?
be: Вы хочаце спыніць робата або спыніць і выдаліць дадзеныя?
ru: Вы хотите остановить бота или остановить и удалить данные?
uk: Ви хочете зупинити бота або зупинити та видалити дані?

# Stop_StoppedFormatMessage
source: Reminder Bot stopped. If you want to use it again, please, send {0} command
be: Reminder Bot спынены. Калі вы захочаце выкарыстоўваць яго зноў, калі ласка, дашліце каманду {0}
ru: Reminder Bot остановлен. Если вы захотите использовать его снова, пожалуйста, отправьте команду {0}
uk: Reminder Bot зупинено. Якщо ви захочете використати його знову, будь ласка, відправте команду {0}

# TelegramBotCommandCancel
source: Cancel current operation
be: Адмяніць цяперашнюю аперацыю
ru: Отменить текущую операцию
uk: Відмінити поточну операцію

# TelegramBotCommandHelp
source: Help
be: Дапамога
ru: Помощь
uk: Довідка

# TelegramBotCommandManage
source: Manage reminders
be: Кіраванне напамінкамі
ru: Управление напоминаниями
uk: Управління нагадуваннями

# TelegramBotCommandSettings
source: Settings
be: Налады
ru: Настройки
uk: Налаштування

# TelegramBotCommandStop
source: Stop bot
be: Спыніць бота
ru: Остановить бота
uk: Зупинити бота

# TelegramBot_UnregisteredUserFormatMessage
source: If you want to use this bot, please, send {0} command
be: Калі вы жадаеце выкарыстоўваць гэтага бота, калі ласка, дашліце каманду {0}
ru: Если вы хотите использовать этого бота, пожалуйста, отправьте команду {0}
uk: Якщо ви хочете використовувати цей бот, будь ласка, відправте команду {0}

# Unknown_Message
source: Unknown command. Please, use commands or menu to perform actions
be: Невядомая каманда. Калі ласка, выкарыстайце меню каманд для здзяйснення дзеянняў
ru: Неизвестная команда. Пожалуйста, используйте меню команд для совершения действий
uk: Невідома команда. Будь ласка, використовуйте меню команд для здійснення дій
